//! Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

let arr1 = [1, 2, 3]
let arr2 = [4, 5, 6]

console.log(arr1.concat(arr2))

//! Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

let arr3 = [1, 2, 3]

console.log(arr3.reverse())

//! Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

let arr4 = [1, 2, 3]

arr4.push(4, 5, 6)

console.log(arr4)

//!  Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

let arr5 = [1, 2, 3];

arr5.unshift(4, 5, 6);

console.log(arr5);

//! Дан массив ['js', 'css', 'jq']. Выведите в консоли  первый элемент.

let arr6 = ['js', 'css', 'jq'];

console.log(arr6.shift());

//! ан массив ['js', 'css', 'jq']. Выведите а консоли последний элемент. 

let arr7 = ['js', 'css', 'jq'];

console.log(arr7.pop());

//! Дан массив [1, 2, 3, 4, 5]. 
//! С помощью метода slice запишите в новый элементы [1, 2, 3].

let arr8 = [1, 2, 3, 4, 5];

console.log(arr8.slice(0, 3))

//! Дан массив [1, 2, 3, 4, 5]. 
//! С помощью метода slice запишите в новый элементы [4, 5].

let arr9 = [1, 2, 3, 4, 5];

console.log(arr9.slice(3));

//! Дан массив [1, 2, 3, 4, 5]. 
//! С помощью метода splice преобразуйте массив в [1, 4, 5].

let arr10 = [1, 2, 3, 4, 5];

console.log(arr10.splice(0, 3))

//! Дан массив [1, 2, 3, 4, 5]. 
//! С помощью метода splice запишите в новый массив элементы [2, 3, 4].

let arr11 = [1, 2, 3, 4, 5];

console.log(arr11.splice(1, 3));

//! Дан массив [1, 2, 3, 4, 5]. 
//! С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

let arr12 = [1, 2, 3, 4, 5];

arr12.splice(3, 0, 'a', 'b', 'c',);

console.log(arr12);

//! Дан массив [1, 2, 3, 4, 5]. 
//! С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

let arr13 = [1, 2, 3, 4, 5];

arr13.splice(1, 0, 'a', 'b'), arr13.splice(6, 0, 'c'), arr13.splice(8, 0, 'e');

console.log(arr13);